# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 14  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_c/hannels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:

  - [-1, 1, Conv, [64, 3, 2]]                  #0
  - [-1, 1, Conv, [128, 3, 2]]                 #1
  - [-1, 3, C2f, [128, True]]                  #2
  - [-1, 1, Conv, [256, 3, 2]]                 #3
  - [-1, 6, C2f, [256, True]]                  #4
  - [-1, 1, Conv, [512, 3, 2]]                 #5
  - [-1, 6, C2f, [512, True]]                  #6
  - [-1, 1, Conv, [1024, 3, 2]]                #7
  - [-1, 3, C2f, [1024, True]]                 #8
  - [-1, 1, SPPF, [1024, 5]]                   #9


# YOLOv8.0n head
head:
#  - [9,1,CoordAtt,[1024]]
#  - [6,1,CoordAtt,[512]]
#  - [4,1,CoordAtt,[256]]

#  - [9,1,GAM_Attention,[1024]]
#  - [6,1,GAM_Attention,[512]]
#  - [4,1,GAM_Attention,[256]]

#  - [9,1,CBAM,[1024,7]]
#  - [6,1,CBAM,[512,7]]
#  - [4,1,CBAM,[256,7]]

#  - [9,1,SE,[1024]]
#  - [6,1,SE,[512]]
#  - [4,1,SE,[256]]

#  - [9,1,ECA,[]]
#  - [6,1,ECA,[]]
#  - [4,1,ECA,[]]

#  - [9,1,EMA,[]]
#  - [6,1,EMA,[]]
#  - [4,1,EMA,[]]

  - [9, 1, MAM, [1024]]                        #10
  - [6, 1, MAM, [512]]                         #11
  - [4, 1, MAM, [256]]                         #12

  - [10, 1, nn.Upsample, [None, 2, 'nearest']] #13
  - [[-1, 11], 1, Concat, [1]]                 #14
  - [-1, 3, C2f, [512]]                        #15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #16
  - [[-1, 12], 1, Concat, [1]]                 #17
  - [-1, 3, C2f, [256]]                        #18

  - [-1, 1, Conv, [256, 3, 2]]                 #19
  - [[-1, 15], 1, Concat, [1]]                 #20
  - [-1, 3, C2f, [512]]                        #21

  - [-1, 1, Conv, [512, 3, 2]]                 #22
  - [[-1, 10], 1, Concat, [1]]                 #23
  - [-1, 3, C2f, [1024]]                       #24

  - [[18, 21, 24], 1, Segment, [nc, 32, 256]]
